In [1]:
import pandas as pd

In [3]:
titanic = pd.read_csv(r"C:\Users\User\Desktop\titanic.csv")

In [4]:
titanic.head()

,PassengerId,Survived,Pclass,Lname,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,Braund,Mr. Owen Harris,male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,Cumings,Mrs. John Bradley (Florence Briggs Thayer),female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,Heikkinen,Miss. Laina,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,Futrelle,Mrs. Jacques Heath (Lily May Peel),female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,Allen,Mr. William Henry,male,35.0,0,0,373450,8.0500,NaN,S

In [5]:
titanic["Age"].mean()

28.141507936507935

In [6]:
titanic[["Age", "Fare"]].median()

Age     26.0000
Fare    14.4542
dtype: float64

In [7]:
titanic[["Age", "Fare"]].describe()

              Age        Fare
count  126.000000  156.000000
mean    28.141508   28.109587
std     14.613880   39.401047
min      0.830000    6.750000
25%     19.000000    8.003150
50%     26.000000   14.454200
75%     35.000000   30.371850
max     71.000000  263.000000

In [8]:
titanic.agg(
    {
        "Age": ["min", "max", "median", "skew"],
        "Fare": ["min", "max", "median", "mean"],
    }
)

              Age        Fare
min      0.830000    6.750000
max     71.000000  263.000000
median  26.000000   14.454200
skew     0.700367         NaN
mean          NaN   28.109587

In [9]:
titanic[["Sex", "Age"]].groupby("Sex").mean()

              Age
Sex
female  24.468085
male    30.326962

In [10]:
titanic.groupby("Sex").mean()

        PassengerId  Survived    Pclass        Age  SibSp     Parch       Fare
Sex
female       68.125  0.714286  2.464286  24.468085  0.875  0.517857  28.460639
male         84.310  0.140000  2.400000  30.326962  0.470  0.330000  27.912998

In [11]:
titanic.groupby("Sex")["Age"].mean()

Sex
female    24.468085
male      30.326962
Name: Age, dtype: float64

In [12]:
titanic.groupby(["Sex", "Pclass"])["Fare"].mean()

Sex     Pclass
female  1         90.007400
        2         21.325000
        3         15.080834
male    1         74.999600
        2         25.216200
        3         12.498633
Name: Fare, dtype: float64

In [13]:
titanic["Pclass"].value_counts()

3    96
1    30
2    30
Name: Pclass, dtype: int64

In [14]:
titanic.groupby("Pclass")["Pclass"].count()

Pclass
1    30
2    30
3    96
Name: Pclass, dtype: int64